document.addEventListener('DOMContentLoaded', (event) => {
    const textarea = document.getElementById('banglaInput');

    const romanToBengaliMap = {
            'A': 'অ',
            'I': 'ই',
            'Y': 'ঈ',
            'U': 'উ',
            'W': 'ঊ',
            'E': 'এ',
            'F': 'ঐ',
            'O': 'ও',
            'k': 'ক',
            'K': 'খ',
            'g': 'গ',
            'G': 'ঘ',
            'q': 'ঙ',
            'c': 'চ',
            'C': 'ছ',
            'j': 'জ',
            'z': 'ঝ',
            'Q': 'ঞ',
            'T': 'ট',
            'M': 'ঠ',
            'D': 'ড',
            'V': 'ঢ',
            'N': 'ণ',
            't': 'ত',
            'L': 'থ',
            'd': 'দ',
            'v': 'ধ',
            'n': 'ন',
            'p': 'প',
            'P': 'ফ',
            'b': 'ব',
            'B': 'ভ',
            'm': 'ম',
            'J': 'য',
            'r': 'র',
            'l': 'ল',
            'S': 'শ',
            'x': 'ষ',
            's': 'স',
            'h': 'হ',
            'R': 'ড়',
            '\\': 'ঢ়',
            'H': 'য়',
            '&': 'ৎ',
            '#': 'ং',
            '@': 'ঃ',
            '`': 'ঁ',
            '.': '।',
            ',': ',',
            '?': '?',
            '!': '!',
            'a': 'া',
            'i': 'ি',
            'y': 'ী',
            'u': 'ু',
            'w': 'ূ',
            'e': 'ে',
            'f': 'ৈ',
            'o': 'ো',
            'Z': 'ঋ',
            '1': '১',
            '2': '২',
            '3': '৩',
            '4': '৪',
            '5': '৫',
            '6': '৬',
            '7': '৭',
            '8': '৮',
            '9': '৯',
            '0': '০',
            '+-': '্',
            '*': '×',
            '/-': '÷',
            '+a': 'আ',
            '+o': 'ৌ',
            '+O': 'ঔ'
    };


    const jointLettersMap = {
        'অ':{'a':'আ'},
        'ও':{'o':'ঔ','u':'ৌ'},
        'ক': {'k': 'ক্ক', 'K': 'ক্খ', 'g': 'ক্গ', 'G': 'ক্ঘ', 'c': 'ক্চ', 'C': 'ক্ছ', 'j': 'ক্জ', 'z': 'ক্ঝ', 'T': 'ক্ট', 'M': 'ক্ঠ', 'D': 'ক্ড', 'V': 'ক্ঢ', 't': 'ক্ত', 'L': 'ক্থ', 'd': 'ক্দ', 'D': 'ক্ধ', 'n': 'ক্ন', 'p': 'ক্প', 'P': 'ক্ফ', 'b': 'ক্ব', 'B': 'ক্ভ', 'm': 'ক্ম', 'J': 'ক্য', 'x': 'ক্স', 'h': 'ক্হ'},
        'গ': {'g': 'গ্গ', 'G': 'গ্ঘ', 'n': 'গ্ন', 'm': 'গ্ম', 'J': 'গ্য'},
        'চ': {'c': 'চ্চ', 'C': 'চ্ছ'},
        'জ': {'j': 'জ্জ', 'z': 'জ্ঝ', 'q': 'জ্ঞ', 'J': 'জ্য'},
        'ট': {'T': 'ট্ট', 'M': 'ট্ঠ', 'D': 'ট্ড', 'V': 'ট্ঢ'},
        'ড': {'D': 'ড্ড', 'V': 'ড্ঢ'},
        'ণ': {'T': 'ণ্ট', 'M': 'ণ্ঠ', 'D': 'ণ্ড', 'V': 'ণ্ঢ', 'ṇ': 'ণ্ণ'},
        'ত': {'t': 'ত্ত', 'L': 'ত্থ', 'd': 'ত্দ', 'D': 'ত্ধ', 'n': 'ত্ন', 'p': 'ত্প', 'b': 'ত্ব', 'm': 'ত্ম', 'J': 'ত্য', 'r': 'ত্র'},
        'দ': {'d': 'দ্দ', 'D': 'দ্ধ', 'n': 'দ্ন', 'b': 'দ্ব', 'm': 'দ্ম', 'J': 'দ্য', 'r': 'দ্র'},
        'ধ': {'n': 'ধ্ন', 'm': 'ধ্ম', 'J': 'ধ্য'},
        'ন': {'k': 'ঙ্ক', 'K': 'ন্খ', 'g': 'ন্গ', 'G': 'ন্ঘ', 'T': 'ন্ট', 'M': 'ণ্ঠ', 'D': 'ন্ড', 'V': 'ন্ঢ', 't': 'ন্ত', 'L': 'ন্থ', 'd': 'ন্দ', 'v': 'ন্ধ', 'b': 'ন্ব', 'm': 'ন্ম', 'J': 'ন্য'},
        'প': {'T': 'প্ট', 't': 'প্ত', 'L': 'প্থ', 'n': 'প্ন', 'm': 'প্ম', 'l': 'প্ল', 'r': 'প্র'},
        'ফ': {'l': 'ফ্ল'},
        'ব': {'d': 'ব্দ', 'v': 'ব্ধ', 'n': 'ব্ন', 'l': 'ব্ল', 'm': 'ব্ম', 'J': 'ব্য', 'r': 'ব্র'},
        'ভ': {'l': 'ভ্ল'},
        'ম': {'p': 'ম্প', 'P': 'ম্ফ', 'b': 'ম্ব', 'B': 'ম্ভ', 'm': 'ম্ম', 'J': 'ম্য', 'r': 'ম্র'},
        'য': {'Q': 'জ্ঞ', 'J': 'য্য', 'r': 'য্র'},
        'র': {'k': 'র্ক', 'g': 'র্গ', 'T': 'র্ট','j':'র্জ', 'M': 'র্ঠ', 'D': 'র্ড', 'V': 'র্ঢ', 't': 'র্ত', 'L': 'র্থ', 'd': 'র্দ', 'v': 'র্ধ', 'n': 'র্ন', 'P': 'র্ফ', 'p': 'র্প', 'b': 'র্ব', 'B': 'র্ভ', 'm': 'র্ম', 'J': 'র্য', 'l': 'র্ল', 's': 'র্স', 'h': 'র্হ'},
        'ল': {'k': 'ল্ক', 'g': 'ল্গ', 'c': 'ল্চ', 'j': 'ল্জ', 'T': 'ল্ট', 'D': 'ল্ড', 't': 'ল্ত', 'L': 'ল্থ', 'd': 'ল্দ', 'v': 'ল্ধ', 'n': 'ল্ন', 'p': 'ল্প', 'P': 'ল্ফ', 'b': 'ল্ব', 'm': 'ল্ম', 'J': 'ল্য', 'l': 'ল্ল', 's': 'ল্স'},
        'শ': {'c': 'শ্চ', 'C': 'শ্ছ', 'j': 'শ্জ', 'z': 'শ্ঝ', 't': 'শ্ত', 'L': 'শ্থ', 'd': 'শ্দ', 'v': 'শ্ধ', 'n': 'শ্ন', 'p': 'শ্প', 'P': 'শ্ফ', 'b': 'শ্ব', 'm': 'শ্ম', 'r': 'শ্র'},
        'ষ': {'k': 'ষ্ক', 'K': 'ষ্খ', 'g': 'ষ্গ', 'T': 'ষ্ট', 'M': 'ষ্ঠ', 'D': 'ষ্ড', 'V': 'ষ্ঢ', 't': 'ষ্ত', 'L': 'ষ্থ', 'd': 'ষ্দ', 'n': 'ষ্ন', 'p': 'ষ্প', 'P': 'ষ্ফ', 'b': 'ষ্ব', 'm': 'ষ্ম', 'r': 'ষ্র'},
        'স': {'k': 'স্ক', 'K': 'স্খ', 'g': 'স্গ', 'c': 'স্চ', 'C': 'স্ছ', 'j': 'স্জ', 'z': 'স্ঝ', 'T': 'স্ট', 'L': 'স্ঠ', 'D': 'স্ড', 'V': 'স্ঢ', 't': 'স্ত', 'L': 'স্থ', 'd': 'স্দ', 'v': 'স্ধ', 'n': 'স্ন', 'p': 'স্প', 'P': 'স্ফ', 'b': 'স্ব', 'm': 'স্ম', 'r': 'স্র'},
        'হ': {'n': 'হ্ন', 'm': 'হ্ম', 'l': 'হ্ল', 'r': 'হ্র','J':'হ্য'}  
    };

    let lastChar = '';
    let isAltPressed = false;

    function convertToBengali(input) {
        let output = '';
        let i = 0;

        while (i < input.length) {
            let found = false;

            for (let j = 2; j > 0; j--) {
                const substr = input.substring(i, i + j);
                console.log('1');
                
                if (romanToBengaliMap[substr] !== undefined) {
                    output += romanToBengaliMap[substr];
                    lastChar = romanToBengaliMap[substr];
                    i += j;
                    found = true;
                    console.log('3');
                    
                    break;
                }
            }

            if (!found) {
                output += input[i];
                lastChar = input[i];
                i++;
            }
            console.log('4');
        }

        return output;
    }

    textarea.addEventListener('input', function() {
        if (!isAltPressed) {
            const inputText = this.value;
            const convertedText = convertToBengali(inputText);
            this.value = convertedText;
        }
    });

    document.addEventListener('keydown', function(event) {
        if (event.altKey) {
            isAltPressed = true;
        }
    });

    document.addEventListener('keyup', function(event) {
        if (!event.altKey) {
            isAltPressed = false;
        }
    });

    textarea.addEventListener('keydown', function(event) {
        if (isAltPressed && jointLettersMap[lastChar] && jointLettersMap[lastChar][event.key]) {
            event.preventDefault();
            const text = this.value;
            this.value = text.slice(0, -1) + jointLettersMap[lastChar][event.key];

        }
    });
});
   